MENU_TEXT = "Меню:"

COMMANDS = {
    "start": "Узнать больше обо мне.",
    "menu": "Доступ к различным функциям и возможностям.",
    "cancel": "Выйти из диалога",
}

WELCOME_MESSAGE_TEXT = (
    "Привет!\n\n"
    "<b>Flat white</b> - это бот, для поиска соседа и организации коливинга. 🏘️\n\n"
    "Что такое коливинг? Это пространство (дом, квартира),"
    " где люди объединены общими интересами или деятельностью"
    " и проживают в одном пространстве. Например, IT-коливинг с айтишниками,"
    " музыкальный коливинг с музыкантами, аниме-коливинг с анимешниками,"
    " коливинг по вузу или коливинг для удаленщиков и так далее. \n\n"
    "У каждого есть своя комната и общие зоны,"
    " где можно общаться или проводить вместе досуг."
    " Главное найти таких людей и в этом поможет наш бот 💪"
)

CANCEL_TEXT = "Выход из диалога"
