from conversations.menu.constants import (
    CANCEL_COMMAND,
    COMPLAIN_COMMAND,
    MENU_COMMAND,
    START_COMMAND,
)

MENU_TEXT = "Меню:"

COMMANDS = {
    START_COMMAND: "Узнать больше о боте",
    MENU_COMMAND: "Доступ к функциям и возможностям",
    CANCEL_COMMAND: "Отменить",
    COMPLAIN_COMMAND: "Пожаловаться",
}

USEFUL_INFO_TEXT = (
    "Ниже Вы можете ознакомиться с нашим "
    "пользовательским соглашением и политикой конфиденциальности."
)
USER_AGREEMENT_URL = (
    "https://docs.google.com/document/d/1GNpJTMVwUtqJ8wudx78TnXgUmBTfrhhP"
)
PRIVACY_POLICY_URL = (
    "https://docs.google.com/document/d/1FOO5FOGETP60y6mkQk76JthCzykf8XL3qAoL7K72PAg"
)

START_MESSAGE_1 = (
    "Привет! Давай мы познакомим тебя с ботом!"
    "\n\n<b>Flat white – это бот, для поиска соседа и организации коливинга. 🏘</b>"
    "\n\nЧто такое коливинг?"
    "\n\nЭто пространство (дом, квартира),"
    " где люди живут и объединены общими интересами или деятельностью. "
    "\n\nНапример: "
    "\n\nIT-коливинг для разработчиков, UX-дизайнеров и проджект-менеджеров. "
    "\n\nФриланс-коливинг для удаленщиков, копирайтеров, маркетологов,"
    " графических дизайнеров. "
    "\n\nИ предпринимательский коливинг для предпринимателей и стартаперов. "
    "\n\nКоливинг по одному ВУЗу для студентов и аспирантов. "
    "\n\nУ каждого есть своя комната и общие зоны,"
    " где можно общаться или проводить вместе досуг."
    " <b>Главное – найти таких людей, и в этом поможет наш бот 💪</b>"
)

START_MESSAGE_2 = (
    "В нашем боте вы можете выбрать «поиск соседа»,"
    " и бот покажет профили людей как в ушедшем Tinder 💞, с фотографиями и описанием."
    " Ваш будущий сосед уже может жить в коливинге,"
    " и бот покажет вам пространство и описание коливинга. "
    "\n\nВозможно, что ваш потенциальный сосед не имеет пространства в коливинге,"
    " и вы вместе можете искать жилье на «Циан» 🏠 или «Авито» 🛍. "
    "\n\nТакже вы можете выбрать поиск коливинга: бот покажет вам фото коливинга,"
    " его описание и ваших будущих соседей. "
    "\n\nЗдесь нет просто домов, квартир и комнат,"
    " как на других сайтах и телеграм-каналах. В этом разделе именно коливинги ."
)

START_MESSAGE_3 = (
    "\n\nДля нашего проекта очень важно быть в постоянном контакте с пользователем"
    " и быть полезным. А так же мы хотим создавать уютное комьюнити вокруг нашего"
    " проекта и вашего коливинга, встроенный в городскую среду."
    "\n\nИменно поэтому мы создали 2 мультичата для"
    ' <a href="https://t.me/flat_white_chat_moscow">Москвы</a> и'
    ' <a href="https://t.me/flat_white_chat_spb">Санкт-Петербурга</a>.'
    " В этих чатах вы можете найти компанию для совместного досуга,"
    " заявить о своих услугах, найти работу, разместить вакансию,"
    " что-то купить/продать/обменять, или задать вопрос о боте или"
    " пожаловаться на него."
    "\n\nТак же мы настаиваем, что этот бот предназначен для поиска"
    " соседа для совместного проживания, а не интрижки для романтического продолжения."
    " Для этого есть другие боты и приложения. 💔"
    "\n\nУ нашего проекта есть свое медиа в соцсетях и площадках:"
    '\n\n<a href="https://t.me/flat_white_media">Flat White Media |'
    " медиа о коливингах в Telegram</a>"
    '\n<a href="https://vk.com/flat_white_media">Flat White Media |'
    " медиа о коливингах в Вконтакте</a>"
    '\n<a href="https://www.instagram.com/flat_white_media">Flat White Media |'
    " медиа о коливингах в Instagram</a>"
    '\n<a href="https://www.youtube.com/@Flat_White_Media">Flat White Media |'
    " медиа о коливингах в YouTube</a>"
    '\n<a href="https://vc.ru/u/3501847-flat-white-media">Flat White Media |'
    " медиа о коливингах на VC.ru</a>"
    "\n\nЖелаем найти тебе хорошего соседа и создать лучше окружение в коливинге!"
)
