from conversations.menu.constants import CANCEL_COMMAND, MENU_COMMAND, START_COMMAND

MENU_TEXT = "Меню:"

COMMANDS = {
    START_COMMAND: "Узнать больше о боте",
    MENU_COMMAND: "Доступ к функциям и возможностям",
    CANCEL_COMMAND: "Отменить",
}

WELCOME_MESSAGE_TEXT = (
    "Привет!\n\n"
    "<b>Flat white</b> - это бот, для поиска соседа и организации коливинга. 🏘️\n\n"
    "Что такое коливинг? Это пространство (дом, квартира),"
    " где люди объединены общими интересами или деятельностью"
    " и проживают в одном пространстве. Например, IT-коливинг с айтишниками,"
    " музыкальный коливинг с музыкантами, аниме-коливинг с анимешниками,"
    " коливинг по вузу или коливинг для удаленщиков и так далее. \n\n"
    "У каждого есть своя комната и общие зоны,"
    " где можно общаться или проводить вместе досуг."
    " Главное найти таких людей и в этом поможет наш бот 💪"
)

CANCEL_TEXT = "Выход из диалога"
