from conversations.menu.constants import (
    CANCEL_COMMAND,
    COMPLAIN_COMMAND,
    MENU_COMMAND,
    START_COMMAND,
)

MENU_TEXT = "Меню:"

COMMANDS = {
    START_COMMAND: "Узнать больше о боте",
    MENU_COMMAND: "Доступ к функциям и возможностям",
    CANCEL_COMMAND: "Отменить",
    COMPLAIN_COMMAND: "Пожаловаться",
}

USEFUL_INFO_TEXT = (
    "Добро пожаловать в раздел полезной информации!"
    "\nЗдесь ты найдешь важные документы и советы:"
)

WELCOME_MESSAGE = (
    "Привет! Давай мы познакомим тебя с ботом!"
    "\n\n<b>Flat white – это бот, для поиска соседа и организации коливинга. 🏘</b>"
    "\n\nЧто такое коливинг?"
    "\n\nЭто пространство (дом, квартира),"
    " где люди живут и объединены общими интересами или деятельностью. "
    "\n\nНапример: "
    "\n\nIT-коливинг для разработчиков, UX-дизайнеров и проджект-менеджеров. "
    "\n\nФриланс-коливинг для удаленщиков, копирайтеров, маркетологов,"
    " графических дизайнеров. "
    "\n\nИ предпринимательский коливинг для предпринимателей и стартаперов. "
    "\n\nКоливинг по одному ВУЗу для студентов и аспирантов. "
    "\n\nУ каждого есть своя комната и общие зоны,"
    " где можно общаться или проводить вместе досуг."
    " <b>Главное – найти таких людей, и в этом поможет наш бот 💪</b>"
)

USAGE_INSTRUCTIONS_MESSAGE = (
    "Что бы зарегистрироваться, сделайте следующие шаги:"
    "\n\n1) Нажми <b>«Меню»</b> в левом нижнем углу экрана рядом."
    "\n\n2) Далее нажмите <b>«Доступ к возможностям и функциям»</b>."
    "\n\n3) Затем нажмите <b>«Моя анкета»</b>,"
    " бот предложит вам зарегистрироваться в сервисе."
)

ABOUT_SEARCHING_FOR_ROOMMATE_MESSAGE = (
    "Профиль создан!"
    "\n\nВыбирай <b>«Поиск соседа»</b> в <b>«Доступе к функциям и возможностям»</b>,"
    " и бот покажет профили людей как в ушедшем <b>«Tinder 💞»</b>,"
    " с фотографиями и описанием, которые можно лайкать 👍 и дизлайкать 👎."
    "\n\nТвой будущий сосед уже может жить в коливинге,"
    " и бот покажет фото пространства и описание."
    "\n\nВозможно, что твой потенциальный сосед не имеет комнаты в коливинге,"
    " и вы вместе можете искать жилье на <b>«Циан»</b>,"
    " <b>«Авито»</b> и других ресурсах."
)

SOCIAL_MEDIA_MESSAGE = (
    "\n\nДля нашего проекта очень важно быть в постоянном контакте с пользователем"
    " и быть полезным. А так же мы хотим создавать уютное комьюнити вокруг нашего"
    " проекта и вашего коливинга, встроенный в городскую среду."
    "\n\nИменно поэтому мы создали 2 мультичата для"
    ' <a href="https://t.me/flat_white_chat_moscow">Москвы</a> и'
    ' <a href="https://t.me/flat_white_chat_spb">Санкт-Петербурга</a>.'
    " В этих чатах вы можете найти компанию для совместного досуга,"
    " заявить о своих услугах, найти работу, разместить вакансию,"
    " что-то купить/продать/обменять, или задать вопрос о боте или"
    " пожаловаться на него."
    "\n\nТак же мы настаиваем, что этот бот предназначен для поиска"
    " соседа для совместного проживания, а не интрижки для романтического продолжения."
    " Для этого есть другие боты и приложения. 💔"
    "\n\nУ нашего проекта есть свое медиа в соцсетях и площадках:"
    '\n\n<a href="https://t.me/flat_white_media">Flat White Media |'
    " медиа о коливингах в Telegram</a>"
    '\n<a href="https://vk.com/flat_white_media">Flat White Media |'
    " медиа о коливингах в Вконтакте</a>"
    '\n<a href="https://www.instagram.com/flat_white_media">Flat White Media |'
    " медиа о коливингах в Instagram</a>"
    '\n<a href="https://www.youtube.com/@Flat_White_Media">Flat White Media |'
    " медиа о коливингах в YouTube</a>"
    '\n<a href="https://vc.ru/u/3501847-flat-white-media">Flat White Media |'
    " медиа о коливингах на VC.ru</a>"
    "\n\nЖелаем найти тебе хорошего соседа и создать лучше окружение в коливинге!"
)
