from conversations.menu.constants import CANCEL_COMMAND, MENU_COMMAND, START_COMMAND

MENU_TEXT = "Меню:"

COMMANDS = {
    START_COMMAND: "Узнать больше о боте",
    MENU_COMMAND: "Доступ к функциям и возможностям",
    CANCEL_COMMAND: "Отменить",
}

WELCOME_MESSAGE_TEXT = (
    "Привет! Давай я познакомлю тебя с ботом! "

    "<b>Flat white – это бот, для поиска соседа и организации коливинга.</b> 🏘 "

    "Что такое коливинг? "

    "Это пространство (дом, квартира), где люди живут и "
    "объединены общими интересами или деятельностью. "

    "Например:"

    "IT-коливинг для разработчиков, UX-дизайнеров и проджект-менеджеров. "

    "Фриланс-коливинг для удаленщиков, копирайтеров, маркетологов, "
    "графических дизайнеров. "

    "И предпринимательский коливинг для начинающих и не только предпринимателей. "

    "Коливинг по одному ВУЗу для студентов и так далее. "

    "У каждого есть своя комната и общие зоны, где можно общаться или проводить вместе "
    "досуг. "
    "<b>Главное – найти таких людей, и в этом поможет наш бот</b> 💪"
    )

ADDITION_MESSAGE_TEXT = (
    "В нашем боте вы можете выбрать «поиск соседа», "
    "и бот покажет профили людей как в ушедшем Tinder 💞, "

    "с фотографиями и описанием. Ваш будущий сосед уже может жить в коливинге, "
    "и бот покажет вам пространство и описание коливинга. "
    "Также возможно, что ваш потенциальный сосед не имеет пространства в коливинге, "
    "и вы вместе можете искать жилье на «Циан» 🏠 или «Авито» 🛍. "

    "Также вы можете выбрать поиск коливинга: бот покажет вам фото коливинга, "
    "его описание и ваших будущих соседей. "

    "Здесь нет просто домов, квартир и комнат, как на других сайтах и телеграм-каналах."
    "В этом разделе именно коливинги."
)


CANCEL_TEXT = "Выход из диалога"
