ASK_COMPLAIN_TEXT = (
    "Опишите причину жалобы.\n"
    "Чем подробнее вы опишите причину, "
    "тем нам будет легче нам будет установить нарушение и наказать нарушителя"
)

CREATE_REPORT_TEXT = "Сформировать жалобу"

COMPLAIN_TEXT = "Вы хотите пожаловаться на пользователя {name}?"

COMPLAIN_ERROR_TEXT = (
    "Жалобы доступны при просмотре профилей или коливингов других пользователей."
)

CATEGORY_CHOOSE_TEXT = "Выберите причину жалобы"

SCREENSHOT_ATTACH_TEXT = "Есть ли у вас скриншот, на котором демонстрируется нарушение?"

ASK_SCREENSHOT = "Отлично, скриншот поможет установить нарушение! Отправь его в чат."

REPORT_DATA = (
    "Ваша жалоба сформирована!\n"
    "<b>ID пользователя:</b> {user_id}\n"
    "<b>Категория жалобы:</b> {category}\n"
    "<b>Описание жалобы:</b> {text}\n"
    "Спасибо, что помогаете сделать наш проект лучше!"
)

USER_ALREADY_REPORTED = "Вы уже отправляли жалобу на этого пользователя!"
