CURRENT_SEARCH_SETTINGS = """
<b>Текущие настройки поиска соседа:</b>

<b>Город:</b> {location}
<b>Пол соседа:</b> {sex}
<b>Возраст:</b> {age}
"""
PROFILE_DATA = """
<b>Имя:</b> {name}
<b>Пол:</b> {sex}
<b>Возраст:</b> {age}
<b>Место проживания:</b> {location}
<b>О себе:</b> {about}
"""

ASK_SEARCH_SETTINGS = (
    "Будем искать соседа по таким параметрам\n"
    "или хочешь настроить поиск заново?"
)
ASK_LOCATION = "Давай найдем тебе соседа. В каком городе ты планируешь жить?"
ASK_SEX = "С кем планируешь делить жильё?"
ASK_AGE = "Соседа какого возраста хочешь найти?"
ASK_NEXT_PROFILE = (
    "Отлично! Этот пользователь получил твой лайк, если это окажется взаимно, "
    "тебе придет уведомление.\nХочешь продолжить поиск?"
)
NO_MATCHES = (
    "К сожалению, больше нет подходящих тебе соседей.\n"
    "Ты можешь подождать пока они появятся или изменить критерии для поиска."
)
END_OF_SEARCH = (
    "Надеюсь, ты смог найти себе соседа.\n"
    "А если нет, помни, что ты всегда можешь начать поиск заново."
)
LIKE_NOTIFICATION = "Кто-то хочет стать твоим соседом, посмотрим?"
BUTTON_ERROR_MSG = "Выбери соответствующий вариант."

OK_SETTINGS_BTN = "Всё ок, начинаем поиск"
EDIT_SETTINGS_BTN = "Изменить настройки поиска"
MSK_BTN = "Москва"
SPB_BTN = "Санкт-Петербург"
MALE_BTN = "Парень"
FEMALE_BTN = "Девушка"
AGE_18_23_BTN = "18-23"
AGE_24_29_BTN = "24-29"
AGE_30_35_BTN = "30-35"
AGE_36_40_BTN = "36-40"
AGE_41_45_BTN = "41-45"
AGE_46_50_BTN = "46-50"
AGE_51_55_BTN = "51-55"
AGE_55UP_BTN = ">55"
LIKE_BTN = "👍"
DISLIKE_BTN = "👎"
WAIT_BTN = "Ждать"
YES_BTN = "Да"
NO_BTN = "Нет"
