CONSIDER_INVITATION_MSG = (
    "Реши, что делать с приглашением"
)

INVITATION_NO_MSG = (
    "Вы отклонили пришглашение.\n"
    "Если коливинг все-таки нужен, воспользуйтесь поиском"
)

INVITATION_YES_MSG = (
    "Вы приняли пришглашение и будете прикреплены к коливингу."
)

HOST_DATA = (
    "\nО хозяине:\n"
    "<b>Имя:</b> {name}\n"
    "<b>Возраст:</b> {age}\n"
)

COLIVING_DATA = (
    "\nО коливинге:\n"
    "<b>Город:</b> {location}\n"
    "<b>Тип аренды:</b> {room_type}\n"
    "<b>Описание:</b> {about}\n"
    "<b>Стоимость:</b> {price} р./мес.\n"
)

NO_TO_HOST = (
    "отклонил ваше приглашение.\n"
    "Не переживайте и продолжайте поиск жильцов.\n"
    "У вас обязательно получится."
)

YES_TO_HOST = (
    "принял ваше приглашение.\n"
    "Поздравляем и желаем комфортного проживания.\n"
)